station = {
    '숭실대입구': [
        10000,
        [
            ['보라매', 10, 4],
            ['이수', 4, 2]
        ]
    ],
    '보라매': [
        10000,
        [
            ['숭실대입구', 7, 4],
            ['대림', 2, 2],
            ['신림', 2, 4],
            ['대방', 1, 2]
        ]
    ],
    '신림': [
        10000,
        [
            ['보라매', 7, 4],
            ['사당', 4, 4],
            ['대림', 2, 3]
        ]
    ],
    '대림': [
        10000,
        [
            ['신림', 10, 3],
            ['보라매', 10, 2],
            ['가산디지털단지', 1, 2],
            ['신도림', 1, 1]
        ]
    ],
    '가산디지털단지': [
        10000,
        [
            ['대림', 2, 2],
            ['신도림', 2, 2]
        ]
    ],
    '숭실대입구': [
        10000,
        [
            ['보라매', 10, 4],
            ['이수', 4, 2]
        ]
    ],
    '신도림': [
        10000,
        [
            ['가산디지털단지', 7, 2],
            ['대림', 7, 1],
            ['영등포구청', 5, 2],
            ['신길', 5, 2]
        ]
    ],
    '영등포구청': [
        10000,
        [
            ['신도림', 1, 2],
            ['신길', 1, 2],
            ['당산', 9, 1]
        ]
    ],
    '당산': [
        10000,
        [
            ['여의도', 5, 2],
            ['영등포구청', 5, 1]
        ]
    ],
    '신길': [
        10000,
        [
            ['영등포구청', 2, 2],
            ['신도림', 2, 2],
            ['여의도', 9, 1],
            ['대방', 10, 1]
        ]
    ],
    '대방': [
        10000,
        [
            ['신길', 5, 1],
            ['노량진', 9, 1],
            ['샛강', 9, 1],
            ['보라매', 7, 2]
        ]
    ],
    '노량진': [
        10000,
        [
            ['샛강', 10, 1],
            ['대방', 10, 1],
            ['동작', 4, 3]
        ]
    ],
    '동작': [
        10000,
        [
            ['노량진', 1, 3],
            ['이수', 7, 1],
            ['고속터미널', 7, 3]
        ]
    ],
    '고속터미널': [
        10000,
        [
            ['동작', 4, 3],
            ['이수', 4, 2],
            ['교대', 2, 1]
        ]
    ],
    '이수': [
        10000,
        [
            ['숭실대입구', 7, 2],
            ['동작', 9, 1],
            ['사당', 2, 1],
            ['고속터미널', 9, 2]
        ]
    ],
    '사당': [
        10000,
        [
            ['이수', 7, 1],
            ['신림', 10, 4],
            ['교대', 3, 3]
        ]
    ],
    '교대': [
        10000,
        [
            ['사당', 4, 3],
            ['고속터미널', 7, 1],
            ['고속터미널', 9, 1]
        ]
    ],
    '샛강': [
        10000,
        [
            ['여의도', 5, 1],
            ['노량진', 1, 1],
            ['대방', 1, 1]
        ]
    ],
    '여의도': [
        10000,
        [
            ['샛강', 10, 1],
            ['신길', 1, 1],
            ['당산', 2, 2]
        ]
    ],
}

line = {
    '1호선': 1,
    '2호선': 2,
    '3호선': 3,
    '4호선': 4,
    '5호선': 5,
    '6호선': 6,
    '7호선': 7,
    '8호선': 8,
    '9호선': 9,
    '신림선': 10,
}

def search(dir, stops, end, Line ,sub=0):
    if station[stops][0] >= sub:
        station[stops][0] = sub
        dir.append(stops)
    else:
        return '취소'

    if stops == end:
        print(sub)
        print(dir)
        return '도착'

    for i in station[stops][1]:
        search(list(dir), i[0], end, i[1], i[2]+sub)

start = input("출발지:")
end = input("도착지:")

search([], start, end, line['7호선'])
